
var Name = window.prompt('من فضلك اكتب اسمك .. ');

document.getElementById('name').innerHTML= Name;




var qoutes = [
    {
        text : "أسأل الله أن يبارك لكم في شهر الطاعات والرحمات وأن يرزقكم فيه الدرجات وأن يختم لكم فيه بالصالحات.",
        author : "Zeko"

    },
    {
        text : "رمضانك مبارك .. وكل لحظاتك تبارك.. وجنة الخلد دارى ودارك.. والنبى محمد جارى وجارك.  ",
        author : "Zeko"

    },
    {
        text : " كل عام وأنت إلى الله أقرب ولفعل الطاعات أسبق وإلى الجنة أرغب. ",
        author : "Zeko"

    },
    {
        text : " رفع الله قدرك وفرج كربك وبلغك شهر الرحمة ودمت لمن أحبك.",
        author : "Zeko"

    },
        {
        text : " تتهافت القلوب لاستقبالك يا شهر الله، تتجاور المشاعر في رحاب لياليك المقدسة نتبادل المحبة والدعوات الصادقة ومن القلب نهني الأحباب وكل سنة وأنتم طيبين.",
        author : "Zeko"

    },
        {
        text : " ومن خرج من رمضان ولم ينال المغفرة والخير فهو الخاسر الحقيقي.a",
        author : "Zeko"

    },
        {
        text : " رمضان يا شهر الله، فيك الخير والطاعات، تباركت يا ضيف الرحمن، اشتقنا اليك يا رمضان، هللت علينا بالأنوار، وجمعت بيننا بالمحبة والإخاء، وكل عام وأنتم بخير.",
        author : "Zeko"

    },
        {
        text : " اسأل رب العرش العظيم ان يسهل لطريق الجنة خطاك، ويعتقك من النار في شهر رمضان ومبارك عليك شهر رمضان.",
        author : "Zeko"

    },
        {
        text : " اسأل الله العظيم الذي لا تطيب الدنيا إلا بذكره، والآخرة لا تطيب الا بعفوه، والجنة لا تطيب الا برؤيته، ان يقوى صحتك وايمانك ويديم ثباتك ويشرح صدرك ويرفع قدرك .",
        author : "Zeko"

    },
        {
        text : " اسأل الله العظيم ان يعطيك محبة الله في الدنيا، ورؤية الله في الجنة، وأن ينفعك الله بكتابه، ويجمعك الله برسوله الكريم، ويبلغك بالشهر الفضيل.",
        author : "Zeko"

    },
    {
        text : "الله يكثر نور هذا الوجه المنور ويارب يبلغه رمضان مسروراً ويعطيه الله من حلا الحور. ",
        author : "Zeko"

    }

];

function display() {

    var cartona = 0;
    var text = '' ;
    var author= '' ;

    do {
        
        cartona= Math.floor(Math.random()*qoutes.length) 

        text = qoutes[cartona].text; 
        author = qoutes[cartona].author;
    }
    while( document.getElementById("text").innerHTML.includes(text));


    document.getElementById("text").innerHTML=text
    document.getElementById("author").innerHTML=author

}




